IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/TIMA0_1.0.xml
    <register id="TIMA0_PDBGCTL" width="32" offset="0x1018" description="Peripheral Debug Control">
        <bitfield id="FREE" description="Free run control" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="STOP" value="0x0" description="The peripheral freezes functionality while the Core Halted input is asserted and resumes when it is deasserted."/>
            <bitenum id="RUN" value="0x1" description="The peripheral ignores the state of the Core Halted input"/>
        </bitfield>
        <bitfield id="SOFT" description="Soft halt boundary control. This function is only available, if [FREE] is set to 'STOP'" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="IMMEDIATE" value="0x0" description="The peripheral will halt immediately, even if the resultant state will result in corruption if the system is restarted"/>
            <bitenum id="DELAYED" value="0x1" description="The peripheral blocks the debug freeze until it has reached a boundary where it can resume without corruption"/>
        </bitfield>
    </register>
    <group id="TIMA0_INT_EVENT" name="TIMA0_INT_EVENT" instances="3" offset="0x1020" instaddr="0x30" description="">
        <register id="TIMA0_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="Z" value="0x1" description="Interrupt Source: Zero event"/>
                <bitenum id="L" value="0x2" description="REPLACE THIS WITH AN ACTUAL IRQ NAME"/>
                <bitenum id="CCD0" value="0x5" description="Interrupt Source: Capture or compare down event (CCD0)"/>
                <bitenum id="CCD1" value="0x6" description="Interrupt Source: Capture or compare down event (CCD1)"/>
                <bitenum id="CCD2" value="0x7" description="Interrupt Source: Capture or compare down event (CCD2)"/>
                <bitenum id="CCD3" value="0x8" description="Interrupt Source: Capture or compare down event (CCD3)"/>
                <bitenum id="CCU0" value="0x9" description="Interrupt Source: Capture or compare up event (CCU0)"/>
                <bitenum id="CCU1" value="0xA" description="Interrupt Source: Capture or compare up event (CCU1)"/>
                <bitenum id="CCU2" value="0xB" description="Interrupt Source: Capture or compare up event (CCU2)"/>
                <bitenum id="CCU3" value="0xC" description="Interrupt Source: Capture or compare up event (CCU3)"/>
                <bitenum id="CCD4" value="0xD" description="Interrupt Source: Compare down event (CCD4)"/>
                <bitenum id="CCD5" value="0xE" description="Interrupt Source: Compare down event (CCD5)"/>
                <bitenum id="CCU4" value="0xF" description="Interrupt Source: Compare down event (CCU4)"/>
                <bitenum id="CCU5" value="0x10" description="Interrupt Source: Compare down event (CCU5)"/>
                <bitenum id="F" value="0x19" description="Interrupt Source: Fault Event generated an interrupt."/>
                <bitenum id="TOV" value="0x1A" description="Interrupt Source: Trigger overflow"/>
                <bitenum id="REPC" value="0x1B" description="Repeat Counter Zero"/>
                <bitenum id="DC" value="0x1C" description="Interrupt Source: Direction Change"/>
                <bitenum id="QEIERR" value="0x1D" description="QEI Incorrect state transition error"/>
            </bitfield>
        </register>
        <register id="TIMA0_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="Z" description="Zero Event mask" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Disable Event"/>
                <bitenum id="SET" value="0x1" description="Enable Event"/>
            </bitfield>
            <bitfield id="L" description="Load Event mask" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCD0" description="Capture or Compare DN event mask CCP0" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCD1" description="Capture or Compare DN event mask CCP1" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCU0" description="Capture or Compare UP event mask CCP0" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCU1" description="Capture or Compare UP event mask CCP1" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="F" description="Fault Event mask" begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Disable Event"/>
                <bitenum id="SET" value="0x1" description="Enable Event"/>
            </bitfield>
            <bitfield id="TOV" description="Trigger Overflow Event mask" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Disable Event"/>
                <bitenum id="SET" value="0x1" description="Enable Event"/>
            </bitfield>
            <bitfield id="CCD2" description="Capture or Compare DN event mask CCP2" begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCD3" description="Capture or Compare DN event mask CCP3" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCU2" description="Capture or Compare UP event mask CCP2" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCU3" description="Capture or Compare UP event mask CCP3" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCD4" description="Compare DN event mask CCP4" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCD5" description="Compare DN event mask CCP5" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCU4" description="Compare UP event mask CCP4" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCU5" description="Compare UP event mask CCP5" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="REPC" description="Repeat Counter Zero Event mask" begin="26" end="26" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Disable Event"/>
                <bitenum id="SET" value="0x1" description="Enable Event"/>
            </bitfield>
        </register>
